public class Conditions {
    public static void main(String[] args) {

        //Задание 1
        System.out.println("Задание 1");
        int userAge = 56;
        if (userAge>=18) {
            System.out.println("Поздравляем Вас с совершеннолетием!");
        }
        if (userAge<18) {
            System.out.println("Ваше совершеннолетие еще впереди и вам нужно немного подождать!");
        }

    }
}